GopalSaraf/Practicals/PSDL/include/proc/pic16lf18876.inc
// Register: ADPREVH
#define ADPREVH ADPREVH
ADPREVH                                  equ 008Fh
// bitfield definitions
ADPREVH_ADPREVH_POSN                     equ 0000h
ADPREVH_ADPREVH_POSITION                 equ 0000h
ADPREVH_ADPREVH_SIZE                     equ 0008h
ADPREVH_ADPREVH_LENGTH                   equ 0008h
ADPREVH_ADPREVH_MASK                     equ 00FFh
ADPREVH_ADPREV8_POSN                     equ 0000h
ADPREVH_ADPREV8_POSITION                 equ 0000h
ADPREVH_ADPREV8_SIZE                     equ 0001h
ADPREVH_ADPREV8_LENGTH                   equ 0001h
ADPREVH_ADPREV8_MASK                     equ 0001h
ADPREVH_ADPREV9_POSN                     equ 0001h
ADPREVH_ADPREV9_POSITION                 equ 0001h
ADPREVH_ADPREV9_SIZE                     equ 0001h
ADPREVH_ADPREV9_LENGTH                   equ 0001h
ADPREVH_ADPREV9_MASK                     equ 0002h
ADPREVH_ADPREV10_POSN                    equ 0002h
ADPREVH_ADPREV10_POSITION                equ 0002h
ADPREVH_ADPREV10_SIZE                    equ 0001h
ADPREVH_ADPREV10_LENGTH                  equ 0001h
ADPREVH_ADPREV10_MASK                    equ 0004h
ADPREVH_ADPREV11_POSN                    equ 0003h
ADPREVH_ADPREV11_POSITION                equ 0003h
ADPREVH_ADPREV11_SIZE                    equ 0001h
ADPREVH_ADPREV11_LENGTH                  equ 0001h
ADPREVH_ADPREV11_MASK                    equ 0008h
ADPREVH_ADPREV12_POSN                    equ 0004h
ADPREVH_ADPREV12_POSITION                equ 0004h
ADPREVH_ADPREV12_SIZE                    equ 0001h
ADPREVH_ADPREV12_LENGTH                  equ 0001h
ADPREVH_ADPREV12_MASK                    equ 0010h
ADPREVH_ADPREV13_POSN                    equ 0005h
ADPREVH_ADPREV13_POSITION                equ 0005h
ADPREVH_ADPREV13_SIZE                    equ 0001h
ADPREVH_ADPREV13_LENGTH                  equ 0001h
ADPREVH_ADPREV13_MASK                    equ 0020h
ADPREVH_ADPREV14_POSN                    equ 0006h
ADPREVH_ADPREV14_POSITION                equ 0006h
ADPREVH_ADPREV14_SIZE                    equ 0001h
ADPREVH_ADPREV14_LENGTH                  equ 0001h
ADPREVH_ADPREV14_MASK                    equ 0040h
ADPREVH_ADPREV15_POSN                    equ 0007h
ADPREVH_ADPREV15_POSITION                equ 0007h
ADPREVH_ADPREV15_SIZE                    equ 0001h
ADPREVH_ADPREV15_LENGTH                  equ 0001h
ADPREVH_ADPREV15_MASK                    equ 0080h

// Register: ADACCL
#define ADACCL ADACCL
ADACCL                                   equ 0090h
// bitfield definitions
ADACCL_ADACCL_POSN                       equ 0000h
ADACCL_ADACCL_POSITION                   equ 0000h
ADACCL_ADACCL_SIZE                       equ 0008h
ADACCL_ADACCL_LENGTH                     equ 0008h
ADACCL_ADACCL_MASK                       equ 00FFh
ADACCL_ADACC0_POSN                       equ 0000h
ADACCL_ADACC0_POSITION                   equ 0000h
ADACCL_ADACC0_SIZE                       equ 0001h
ADACCL_ADACC0_LENGTH                     equ 0001h
ADACCL_ADACC0_MASK                       equ 0001h
ADACCL_ADACC1_POSN                       equ 0001h
ADACCL_ADACC1_POSITION                   equ 0001h
ADACCL_ADACC1_SIZE                       equ 0001h
ADACCL_ADACC1_LENGTH                     equ 0001h
ADACCL_ADACC1_MASK                       equ 0002h
ADACCL_ADACC2_POSN                       equ 0002h
ADACCL_ADACC2_POSITION                   equ 0002h
ADACCL_ADACC2_SIZE                       equ 0001h
ADACCL_ADACC2_LENGTH                     equ 0001h
ADACCL_ADACC2_MASK                       equ 0004h
ADACCL_ADACC3_POSN                       equ 0003h
ADACCL_ADACC3_POSITION                   equ 0003h
ADACCL_ADACC3_SIZE                       equ 0001h
ADACCL_ADACC3_LENGTH                     equ 0001h
ADACCL_ADACC3_MASK                       equ 0008h
ADACCL_ADACC4_POSN                       equ 0004h
ADACCL_ADACC4_POSITION                   equ 0004h
ADACCL_ADACC4_SIZE                       equ 0001h
ADACCL_ADACC4_LENGTH                     equ 0001h
ADACCL_ADACC4_MASK                       equ 0010h
ADACCL_ADACC5_POSN                       equ 0005h
ADACCL_ADACC5_POSITION                   equ 0005h
ADACCL_ADACC5_SIZE                       equ 0001h
ADACCL_ADACC5_LENGTH                     equ 0001h
ADACCL_ADACC5_MASK                       equ 0020h
ADACCL_ADACC6_POSN                       equ 0006h
ADACCL_ADACC6_POSITION                   equ 0006h
ADACCL_ADACC6_SIZE                       equ 0001h
ADACCL_ADACC6_LENGTH                     equ 0001h
ADACCL_ADACC6_MASK                       equ 0040h
ADACCL_ADACC7_POSN                       equ 0007h
ADACCL_ADACC7_POSITION                   equ 0007h
ADACCL_ADACC7_SIZE                       equ 0001h
ADACCL_ADACC7_LENGTH                     equ 0001h
ADACCL_ADACC7_MASK                       equ 0080h

// Register: ADACCH
#define ADACCH ADACCH
ADACCH                                   equ 0091h
// bitfield definitions
ADACCH_ADACCH_POSN                       equ 0000h
ADACCH_ADACCH_POSITION                   equ 0000h
ADACCH_ADACCH_SIZE                       equ 0008h
ADACCH_ADACCH_LENGTH                     equ 0008h
ADACCH_ADACCH_MASK                       equ 00FFh
ADACCH_ADACC8_POSN                       equ 0000h
ADACCH_ADACC8_POSITION                   equ 0000h
ADACCH_ADACC8_SIZE                       equ 0001h
ADACCH_ADACC8_LENGTH                     equ 0001h
ADACCH_ADACC8_MASK                       equ 0001h
ADACCH_ADACC9_POSN                       equ 0001h
ADACCH_ADACC9_POSITION                   equ 0001h
ADACCH_ADACC9_SIZE                       equ 0001h
ADACCH_ADACC9_LENGTH                     equ 0001h
ADACCH_ADACC9_MASK                       equ 0002h
ADACCH_ADACC10_POSN                      equ 0002h
ADACCH_ADACC10_POSITION                  equ 0002h
ADACCH_ADACC10_SIZE                      equ 0001h
ADACCH_ADACC10_LENGTH                    equ 0001h
ADACCH_ADACC10_MASK                      equ 0004h
ADACCH_ADACC11_POSN                      equ 0003h
ADACCH_ADACC11_POSITION                  equ 0003h
ADACCH_ADACC11_SIZE                      equ 0001h
ADACCH_ADACC11_LENGTH                    equ 0001h
ADACCH_ADACC11_MASK                      equ 0008h
ADACCH_ADACC12_POSN                      equ 0004h
ADACCH_ADACC12_POSITION                  equ 0004h
ADACCH_ADACC12_SIZE                      equ 0001h
ADACCH_ADACC12_LENGTH                    equ 0001h
ADACCH_ADACC12_MASK                      equ 0010h
ADACCH_ADACC13_POSN                      equ 0005h
ADACCH_ADACC13_POSITION                  equ 0005h
ADACCH_ADACC13_SIZE                      equ 0001h
ADACCH_ADACC13_LENGTH                    equ 0001h
ADACCH_ADACC13_MASK                      equ 0020h
ADACCH_ADACC14_POSN                      equ 0006h
ADACCH_ADACC14_POSITION                  equ 0006h
ADACCH_ADACC14_SIZE                      equ 0001h
ADACCH_ADACC14_LENGTH                    equ 0001h
ADACCH_ADACC14_MASK                      equ 0040h
ADACCH_ADACC15_POSN                      equ 0007h
ADACCH_ADACC15_POSITION                  equ 0007h
ADACCH_ADACC15_SIZE                      equ 0001h
ADACCH_ADACC15_LENGTH                    equ 0001h
ADACCH_ADACC15_MASK                      equ 0080h

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 0093h
// bitfield definitions
ADCON0_ADGO_POSN                         equ 0000h
ADCON0_ADGO_POSITION                     equ 0000h
ADCON0_ADGO_SIZE                         equ 0001h
ADCON0_ADGO_LENGTH                       equ 0001h
ADCON0_ADGO_MASK                         equ 0001h
ADCON0_ADFM_POSN                         equ 0002h
ADCON0_ADFM_POSITION                     equ 0002h
ADCON0_ADFM_SIZE                         equ 0002h
ADCON0_ADFM_LENGTH                       equ 0002h
ADCON0_ADFM_MASK                         equ 000Ch
ADCON0_ADCS_POSN                         equ 0004h
ADCON0_ADCS_POSITION                     equ 0004h
ADCON0_ADCS_SIZE                         equ 0001h
ADCON0_ADCS_LENGTH                       equ 0001h
ADCON0_ADCS_MASK                         equ 0010h
ADCON0_ADCONT_POSN                       equ 0006h
ADCON0_ADCONT_POSITION                   equ 0006h
ADCON0_ADCONT_SIZE                       equ 0001h
ADCON0_ADCONT_LENGTH                     equ 0001h
ADCON0_ADCONT_MASK                       equ 0040h
ADCON0_ADON_POSN                         equ 0007h
ADCON0_ADON_POSITION                     equ 0007h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0080h
ADCON0_DONE_POSN                         equ 0000h
ADCON0_DONE_POSITION                     equ 0000h
ADCON0_DONE_SIZE                         equ 0001h
ADCON0_DONE_LENGTH                       equ 0001h
ADCON0_DONE_MASK                         equ 0001h
ADCON0_ADFRM_POSN                        equ 0002h
ADCON0_ADFRM_POSITION                    equ 0002h
ADCON0_ADFRM_SIZE                        equ 0002h
ADCON0_ADFRM_LENGTH                      equ 0002h
ADCON0_ADFRM_MASK                        equ 000Ch
ADCON0_nDONE_POSN                        equ 0000h
ADCON0_nDONE_POSITION                    equ 0000h
ADCON0_nDONE_SIZE                        equ 0001h
ADCON0_nDONE_LENGTH                      equ 0001h
ADCON0_nDONE_MASK                        equ 0001h
ADCON0_GO_POSN                           equ 0000h
ADCON0_GO_POSITION                       equ 0000h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0001h
ADCON0_ADFM0_POSN                        equ 0002h
ADCON0_ADFM0_POSITION                    equ 0002h
ADCON0_ADFM0_SIZE                        equ 0001h
ADCON0_ADFM0_LENGTH                      equ 0001h
ADCON0_ADFM0_MASK                        equ 0004h
ADCON0_ADFM1_POSN                        equ 0003h
ADCON0_ADFM1_POSITION                    equ 0003h
ADCON0_ADFM1_SIZE                        equ 0001h
ADCON0_ADFM1_LENGTH                      equ 0001h
ADCON0_ADFM1_MASK                        equ 0008h
ADCON0_GO_nDONE_POSN                     equ 0000h
ADCON0_GO_nDONE_POSITION                 equ 0000h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0001h
ADCON0_ADFRM0_POSN                       equ 0002h
ADCON0_ADFRM0_POSITION                   equ 0002h
ADCON0_ADFRM0_SIZE                       equ 0001h
ADCON0_ADFRM0_LENGTH                     equ 0001h
ADCON0_ADFRM0_MASK                       equ 0004h
ADCON0_ADFRM1_POSN                       equ 0003h
ADCON0_ADFRM1_POSITION                   equ 0003h
ADCON0_ADFRM1_SIZE                       equ 0001h
ADCON0_ADFRM1_LENGTH                     equ 0001h
ADCON0_ADFRM1_MASK                       equ 0008h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 0094h
// bitfield definitions
ADCON1_ADDSEN_POSN                       equ 0000h
ADCON1_ADDSEN_POSITION                   equ 0000h
ADCON1_ADDSEN_SIZE                       equ 0001h
ADCON1_ADDSEN_LENGTH                     equ 0001h
ADCON1_ADDSEN_MASK                       equ 0001h
ADCON1_ADGPOL_POSN                       equ 0005h
ADCON1_ADGPOL_POSITION                   equ 0005h
ADCON1_ADGPOL_SIZE                       equ 0001h
ADCON1_ADGPOL_LENGTH                     equ 0001h
ADCON1_ADGPOL_MASK                       equ 0020h
ADCON1_ADIPEN_POSN                       equ 0006h
ADCON1_ADIPEN_POSITION                   equ 0006h
ADCON1_ADIPEN_SIZE                       equ 0001h
ADCON1_ADIPEN_LENGTH                     equ 0001h
ADCON1_ADIPEN_MASK                       equ 0040h
ADCON1_ADPPOL_POSN                       equ 0007h
ADCON1_ADPPOL_POSITION                   equ 0007h
ADCON1_ADPPOL_SIZE                       equ 0001h
ADCON1_ADPPOL_LENGTH                     equ 0001h
ADCON1_ADPPOL_MASK                       equ 0080h

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 0095h
// bitfield definitions
ADCON2_ADMD_POSN                         equ 0000h
ADCON2_ADMD_POSITION                     equ 0000h
ADCON2_ADMD_SIZE                         equ 0003h
ADCON2_ADMD_LENGTH                       equ 0003h
ADCON2_ADMD_MASK                         equ 0007h
ADCON2_ADACLR_POSN                       equ 0003h
ADCON2_ADACLR_POSITION                   equ 0003h
ADCON2_ADACLR_SIZE                       equ 0001h
ADCON2_ADACLR_LENGTH                     equ 0001h
ADCON2_ADACLR_MASK                       equ 0008h
ADCON2_ADCRS_POSN                        equ 0004h
ADCON2_ADCRS_POSITION                    equ 0004h
ADCON2_ADCRS_SIZE                        equ 0003h
ADCON2_ADCRS_LENGTH                      equ 0003h
ADCON2_ADCRS_MASK                        equ 0070h
ADCON2_ADPSIS_POSN                       equ 0007h
ADCON2_ADPSIS_POSITION                   equ 0007h
ADCON2_ADPSIS_SIZE                       equ 0001h
ADCON2_ADPSIS_LENGTH                     equ 0001h
ADCON2_ADPSIS_MASK                       equ 0080h
ADCON2_ADMD0_POSN                        equ 0000h
ADCON2_ADMD0_POSITION                    equ 0000h
ADCON2_ADMD0_SIZE                        equ 0001h
ADCON2_ADMD0_LENGTH                      equ 0001h
ADCON2_ADMD0_MASK                        equ 0001h
ADCON2_ADMD1_POSN                        equ 0001h
ADCON2_ADMD1_POSITION                    equ 0001h
ADCON2_ADMD1_SIZE                        equ 0001h
ADCON2_ADMD1_LENGTH                      equ 0001h
ADCON2_ADMD1_MASK                        equ 0002h
ADCON2_ADMD2_POSN                        equ 0002h
ADCON2_ADMD2_POSITION                    equ 0002h
ADCON2_ADMD2_SIZE                        equ 0001h
ADCON2_ADMD2_LENGTH                      equ 0001h
ADCON2_ADMD2_MASK                        equ 0004h
ADCON2_ADCRS0_POSN                       equ 0004h
ADCON2_ADCRS0_POSITION                   equ 0004h
ADCON2_ADCRS0_SIZE                       equ 0001h
ADCON2_ADCRS0_LENGTH                     equ 0001h
ADCON2_ADCRS0_MASK                       equ 0010h
ADCON2_ADCRS1_POSN                       equ 0005h
ADCON2_ADCRS1_POSITION                   equ 0005h
ADCON2_ADCRS1_SIZE                       equ 0001h
ADCON2_ADCRS1_LENGTH                     equ 0001h
ADCON2_ADCRS1_MASK                       equ 0020h
ADCON2_ADCRS2_POSN                       equ 0006h
ADCON2_ADCRS2_POSITION                   equ 0006h
ADCON2_ADCRS2_SIZE                       equ 0001h
ADCON2_ADCRS2_LENGTH                     equ 0001h
ADCON2_ADCRS2_MASK                       equ 0040h

// Register: ADCON3
#define ADCON3 ADCON3
ADCON3                                   equ 0096h
// bitfield definitions
ADCON3_ADTMD0_POSN                       equ 0000h
ADCON3_ADTMD0_POSITION                   equ 0000h
ADCON3_ADTMD0_SIZE                       equ 0001h
ADCON3_ADTMD0_LENGTH                     equ 0001h
ADCON3_ADTMD0_MASK                       equ 0001h
ADCON3_ADTMD1_POSN                       equ 0001h
ADCON3_ADTMD1_POSITION                   equ 0001h
ADCON3_ADTMD1_SIZE                       equ 0001h
ADCON3_ADTMD1_LENGTH                     equ 0001h
ADCON3_ADTMD1_MASK                       equ 0002h
ADCON3_ADTMD2_POSN                       equ 0002h
ADCON3_ADTMD2_POSITION                   equ 0002h
ADCON3_ADTMD2_SIZE                       equ 0001h
ADCON3_ADTMD2_LENGTH                     equ 0001h
ADCON3_ADTMD2_MASK                       equ 0004h
ADCON3_ADCALC0_POSN                      equ 0004h
ADCON3_ADCALC0_POSITION                  equ 0004h
ADCON3_ADCALC0_SIZE                      equ 0001h
ADCON3_ADCALC0_LENGTH                    equ 0001h
ADCON3_ADCALC0_MASK                      equ 0010h
ADCON3_ADCALC1_POSN                      equ 0005h
ADCON3_ADCALC1_POSITION                  equ 0005h
ADCON3_ADCALC1_SIZE                      equ 0001h
ADCON3_ADCALC1_LENGTH                    equ 0001h
ADCON3_ADCALC1_MASK                      equ 0020h
ADCON3_ADCALC2_POSN                      equ 0006h
ADCON3_ADCALC2_POSITION                  equ 0006h
ADCON3_ADCALC2_SIZE                      equ 0001h
ADCON3_ADCALC2_LENGTH                    equ 0001h
ADCON3_ADCALC2_MASK                      equ 0040h
ADCON3_ADTMD_POSN                        equ 0000h
ADCON3_ADTMD_POSITION                    equ 0000h
ADCON3_ADTMD_SIZE                        equ 0003h
ADCON3_ADTMD_LENGTH                      equ 0003h
ADCON3_ADTMD_MASK                        equ 0007h
ADCON3_ADSOI_POSN                        equ 0003h
ADCON3_ADSOI_POSITION                    equ 0003h
ADCON3_ADSOI_SIZE                        equ 0001h
ADCON3_ADSOI_LENGTH                      equ 0001h
ADCON3_ADSOI_MASK                        equ 0008h
ADCON3_ADCALC_POSN                       equ 0004h
ADCON3_ADCALC_POSITION                   equ 0004h
ADCON3_ADCALC_SIZE                       equ 0003h
ADCON3_ADCALC_LENGTH                     equ 0003h
ADCON3_ADCALC_MASK                       equ 0070h

// Register: ADSTAT
#define ADSTAT ADSTAT
ADSTAT                                   equ 0097h
// bitfield definitions
ADSTAT_ADSTAT_POSN                       equ 0000h
ADSTAT_ADSTAT_POSITION                   equ 0000h
ADSTAT_ADSTAT_SIZE                       equ 0003h
ADSTAT_ADSTAT_LENGTH                     equ 0003h
ADSTAT_ADSTAT_MASK                       equ 0007h
ADSTAT_ADMACT_POSN                       equ 0003h
ADSTAT_ADMACT_POSITION                   equ 0003h
ADSTAT_ADMACT_SIZE                       equ 0001h
ADSTAT_ADMACT_LENGTH                     equ 0001h
ADSTAT_ADMACT_MASK                       equ 0008h
ADSTAT_ADMATH_POSN                       equ 0004h
ADSTAT_ADMATH_POSITION                   equ 0004h
ADSTAT_ADMATH_SIZE                       equ 0001h
ADSTAT_ADMATH_LENGTH                     equ 0001h
ADSTAT_ADMATH_MASK                       equ 0010h
ADSTAT_ADLTHR_POSN                       equ 0005h
ADSTAT_ADLTHR_POSITION                   equ 0005h
ADSTAT_ADLTHR_SIZE                       equ 0001h
ADSTAT_ADLTHR_LENGTH                     equ 0001h
ADSTAT_ADLTHR_MASK                       equ 0020h
ADSTAT_ADUTHR_POSN                       equ 0006h
ADSTAT_ADUTHR_POSITION                   equ 0006h
ADSTAT_ADUTHR_SIZE                       equ 0001h
ADSTAT_ADUTHR_LENGTH                     equ 0001h
ADSTAT_ADUTHR_MASK                       equ 0040h
ADSTAT_ADAOV_POSN                        equ 0007h
ADSTAT_ADAOV_POSITION                    equ 0007h
ADSTAT_ADAOV_SIZE                        equ 0001h
ADSTAT_ADAOV_LENGTH                      equ 0001h
ADSTAT_ADAOV_MASK                        equ 0080h
ADSTAT_ADSTAT0_POSN                      equ 0000h
ADSTAT_ADSTAT0_POSITION                  equ 0000h
ADSTAT_ADSTAT0_SIZE                      equ 0001h
ADSTAT_ADSTAT0_LENGTH                    equ 0001h
ADSTAT_ADSTAT0_MASK                      equ 0001h
ADSTAT_ADSTAT1_POSN                      equ 0001h
ADSTAT_ADSTAT1_POSITION                  equ 0001h
ADSTAT_ADSTAT1_SIZE                      equ 0001h
ADSTAT_ADSTAT1_LENGTH                    equ 0001h
ADSTAT_ADSTAT1_MASK                      equ 0002h
ADSTAT_ADSTAT2_POSN                      equ 0002h
ADSTAT_ADSTAT2_POSITION                  equ 0002h
ADSTAT_ADSTAT2_SIZE                      equ 0001h
ADSTAT_ADSTAT2_LENGTH                    equ 0001h
ADSTAT_ADSTAT2_MASK                      equ 0004h

