GopalSaraf/Practicals/PSDL/include/proc/pic16lf18876.inc
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0EC5h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0005h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0005h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 001Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0EC6h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0005h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0005h
SSP1DATPPS_SSP1DATPPS_MASK               equ 001Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0EC7h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0005h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0005h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 001Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 0EC8h
// bitfield definitions
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0005h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0005h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 001Fh
SSP2CLKPPS_SSP2CLKPPS0_POSN              equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_POSITION          equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_MASK              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSN              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSITION          equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_MASK              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSN              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSITION          equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_MASK              equ 0004h
SSP2CLKPPS_SSP2CLKPPS3_POSN              equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_POSITION          equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_MASK              equ 0008h
SSP2CLKPPS_SSP2CLKPPS4_POSN              equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_POSITION          equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_MASK              equ 0010h

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 0EC9h
// bitfield definitions
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0005h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0005h
SSP2DATPPS_SSP2DATPPS_MASK               equ 001Fh
SSP2DATPPS_SSP2DATPPS0_POSN              equ 0000h
SSP2DATPPS_SSP2DATPPS0_POSITION          equ 0000h
SSP2DATPPS_SSP2DATPPS0_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS0_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS0_MASK              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSN              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSITION          equ 0001h
SSP2DATPPS_SSP2DATPPS1_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS1_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS1_MASK              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSN              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSITION          equ 0002h
SSP2DATPPS_SSP2DATPPS2_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS2_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS2_MASK              equ 0004h
SSP2DATPPS_SSP2DATPPS3_POSN              equ 0003h
SSP2DATPPS_SSP2DATPPS3_POSITION          equ 0003h
SSP2DATPPS_SSP2DATPPS3_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS3_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS3_MASK              equ 0008h
SSP2DATPPS_SSP2DATPPS4_POSN              equ 0004h
SSP2DATPPS_SSP2DATPPS4_POSITION          equ 0004h
SSP2DATPPS_SSP2DATPPS4_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS4_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS4_MASK              equ 0010h

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 0ECAh
// bitfield definitions
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0005h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0005h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 001Fh
SSP2SSPPS_SSP2SSPPS0_POSN                equ 0000h
SSP2SSPPS_SSP2SSPPS0_POSITION            equ 0000h
SSP2SSPPS_SSP2SSPPS0_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS0_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS0_MASK                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSN                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSITION            equ 0001h
SSP2SSPPS_SSP2SSPPS1_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS1_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS1_MASK                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSN                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSITION            equ 0002h
SSP2SSPPS_SSP2SSPPS2_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS2_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS2_MASK                equ 0004h
SSP2SSPPS_SSP2SSPPS3_POSN                equ 0003h
SSP2SSPPS_SSP2SSPPS3_POSITION            equ 0003h
SSP2SSPPS_SSP2SSPPS3_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS3_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS3_MASK                equ 0008h
SSP2SSPPS_SSP2SSPPS4_POSN                equ 0004h
SSP2SSPPS_SSP2SSPPS4_POSITION            equ 0004h
SSP2SSPPS_SSP2SSPPS4_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS4_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS4_MASK                equ 0010h

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0ECBh
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh
RXPPS_RXPPS0_POSN                        equ 0000h
RXPPS_RXPPS0_POSITION                    equ 0000h
RXPPS_RXPPS0_SIZE                        equ 0001h
RXPPS_RXPPS0_LENGTH                      equ 0001h
RXPPS_RXPPS0_MASK                        equ 0001h
RXPPS_RXPPS1_POSN                        equ 0001h
RXPPS_RXPPS1_POSITION                    equ 0001h
RXPPS_RXPPS1_SIZE                        equ 0001h
RXPPS_RXPPS1_LENGTH                      equ 0001h
RXPPS_RXPPS1_MASK                        equ 0002h
RXPPS_RXPPS2_POSN                        equ 0002h
RXPPS_RXPPS2_POSITION                    equ 0002h
RXPPS_RXPPS2_SIZE                        equ 0001h
RXPPS_RXPPS2_LENGTH                      equ 0001h
RXPPS_RXPPS2_MASK                        equ 0004h
RXPPS_RXPPS3_POSN                        equ 0003h
RXPPS_RXPPS3_POSITION                    equ 0003h
RXPPS_RXPPS3_SIZE                        equ 0001h
RXPPS_RXPPS3_LENGTH                      equ 0001h
RXPPS_RXPPS3_MASK                        equ 0008h
RXPPS_RXPPS4_POSN                        equ 0004h
RXPPS_RXPPS4_POSITION                    equ 0004h
RXPPS_RXPPS4_SIZE                        equ 0001h
RXPPS_RXPPS4_LENGTH                      equ 0001h
RXPPS_RXPPS4_MASK                        equ 0010h

// Register: TXPPS
#define TXPPS TXPPS
TXPPS                                    equ 0ECCh
// bitfield definitions
TXPPS_TXPPS_POSN                         equ 0000h
TXPPS_TXPPS_POSITION                     equ 0000h
TXPPS_TXPPS_SIZE                         equ 0005h
TXPPS_TXPPS_LENGTH                       equ 0005h
TXPPS_TXPPS_MASK                         equ 001Fh
TXPPS_TXPPS0_POSN                        equ 0000h
TXPPS_TXPPS0_POSITION                    equ 0000h
TXPPS_TXPPS0_SIZE                        equ 0001h
TXPPS_TXPPS0_LENGTH                      equ 0001h
TXPPS_TXPPS0_MASK                        equ 0001h
TXPPS_TXPPS1_POSN                        equ 0001h
TXPPS_TXPPS1_POSITION                    equ 0001h
TXPPS_TXPPS1_SIZE                        equ 0001h
TXPPS_TXPPS1_LENGTH                      equ 0001h
TXPPS_TXPPS1_MASK                        equ 0002h
TXPPS_TXPPS2_POSN                        equ 0002h
TXPPS_TXPPS2_POSITION                    equ 0002h
TXPPS_TXPPS2_SIZE                        equ 0001h
TXPPS_TXPPS2_LENGTH                      equ 0001h
TXPPS_TXPPS2_MASK                        equ 0004h
TXPPS_TXPPS3_POSN                        equ 0003h
TXPPS_TXPPS3_POSITION                    equ 0003h
TXPPS_TXPPS3_SIZE                        equ 0001h
TXPPS_TXPPS3_LENGTH                      equ 0001h
TXPPS_TXPPS3_MASK                        equ 0008h
TXPPS_TXPPS4_POSN                        equ 0004h
TXPPS_TXPPS4_POSITION                    equ 0004h
TXPPS_TXPPS4_SIZE                        equ 0001h
TXPPS_TXPPS4_LENGTH                      equ 0001h
TXPPS_TXPPS4_MASK                        equ 0010h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0F10h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0F11h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0F12h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

