GopalSaraf/Practicals/PSDL/include/proc/pic16lf18876.inc
#define CCDNB1                           BANKMASK(CCDNB), 1
#define CCDNB2                           BANKMASK(CCDNB), 2
#define CCDNB3                           BANKMASK(CCDNB), 3
#define CCDNB4                           BANKMASK(CCDNB), 4
#define CCDNB5                           BANKMASK(CCDNB), 5
#define CCDNB6                           BANKMASK(CCDNB), 6
#define CCDNB7                           BANKMASK(CCDNB), 7
#define CCDNC0                           BANKMASK(CCDNC), 0
#define CCDNC1                           BANKMASK(CCDNC), 1
#define CCDNC2                           BANKMASK(CCDNC), 2
#define CCDNC3                           BANKMASK(CCDNC), 3
#define CCDNC4                           BANKMASK(CCDNC), 4
#define CCDNC5                           BANKMASK(CCDNC), 5
#define CCDNC6                           BANKMASK(CCDNC), 6
#define CCDNC7                           BANKMASK(CCDNC), 7
#define CCDND0                           BANKMASK(CCDND), 0
#define CCDND1                           BANKMASK(CCDND), 1
#define CCDND2                           BANKMASK(CCDND), 2
#define CCDND3                           BANKMASK(CCDND), 3
#define CCDND4                           BANKMASK(CCDND), 4
#define CCDND5                           BANKMASK(CCDND), 5
#define CCDND6                           BANKMASK(CCDND), 6
#define CCDND7                           BANKMASK(CCDND), 7
#define CCDNE0                           BANKMASK(CCDNE), 0
#define CCDNE1                           BANKMASK(CCDNE), 1
#define CCDNE2                           BANKMASK(CCDNE), 2
#define CCDPA0                           BANKMASK(CCDPA), 0
#define CCDPA1                           BANKMASK(CCDPA), 1
#define CCDPA2                           BANKMASK(CCDPA), 2
#define CCDPA3                           BANKMASK(CCDPA), 3
#define CCDPA4                           BANKMASK(CCDPA), 4
#define CCDPA5                           BANKMASK(CCDPA), 5
#define CCDPA6                           BANKMASK(CCDPA), 6
#define CCDPA7                           BANKMASK(CCDPA), 7
#define CCDPB0                           BANKMASK(CCDPB), 0
#define CCDPB1                           BANKMASK(CCDPB), 1
#define CCDPB2                           BANKMASK(CCDPB), 2
#define CCDPB3                           BANKMASK(CCDPB), 3
#define CCDPB4                           BANKMASK(CCDPB), 4
#define CCDPB5                           BANKMASK(CCDPB), 5
#define CCDPB6                           BANKMASK(CCDPB), 6
#define CCDPB7                           BANKMASK(CCDPB), 7
#define CCDPC0                           BANKMASK(CCDPC), 0
#define CCDPC1                           BANKMASK(CCDPC), 1
#define CCDPC2                           BANKMASK(CCDPC), 2
#define CCDPC3                           BANKMASK(CCDPC), 3
#define CCDPC4                           BANKMASK(CCDPC), 4
#define CCDPC5                           BANKMASK(CCDPC), 5
#define CCDPC6                           BANKMASK(CCDPC), 6
#define CCDPC7                           BANKMASK(CCDPC), 7
#define CCDPD0                           BANKMASK(CCDPD), 0
#define CCDPD1                           BANKMASK(CCDPD), 1
#define CCDPD2                           BANKMASK(CCDPD), 2
#define CCDPD3                           BANKMASK(CCDPD), 3
#define CCDPD4                           BANKMASK(CCDPD), 4
#define CCDPD5                           BANKMASK(CCDPD), 5
#define CCDPD6                           BANKMASK(CCDPD), 6
#define CCDPD7                           BANKMASK(CCDPD), 7
#define CCDPE0                           BANKMASK(CCDPE), 0
#define CCDPE1                           BANKMASK(CCDPE), 1
#define CCDPE2                           BANKMASK(CCDPE), 2
#define CCDS0                            BANKMASK(CCDCON), 0
#define CCDS1                            BANKMASK(CCDCON), 1
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE6), 0
#define CCP1IF                           BANKMASK(PIR6), 0
#define CCP1MD                           BANKMASK(PMD3), 0
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE6), 1
#define CCP2IF                           BANKMASK(PIR6), 1
#define CCP2MD                           BANKMASK(PMD3), 1
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2
#define CCP3EN                           BANKMASK(CCP3CON), 7
#define CCP3FMT                          BANKMASK(CCP3CON), 4
#define CCP3IE                           BANKMASK(PIE6), 2
#define CCP3IF                           BANKMASK(PIR6), 2
#define CCP3MD                           BANKMASK(PMD3), 2
#define CCP3MODE0                        BANKMASK(CCP3CON), 0
#define CCP3MODE1                        BANKMASK(CCP3CON), 1
#define CCP3MODE2                        BANKMASK(CCP3CON), 2
#define CCP3MODE3                        BANKMASK(CCP3CON), 3
#define CCP3OUT                          BANKMASK(CCP3CON), 5
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2
#define CCP4EN                           BANKMASK(CCP4CON), 7
#define CCP4FMT                          BANKMASK(CCP4CON), 4
#define CCP4IE                           BANKMASK(PIE6), 3
#define CCP4IF                           BANKMASK(PIR6), 3
#define CCP4MD                           BANKMASK(PMD3), 3
#define CCP4MODE0                        BANKMASK(CCP4CON), 0
#define CCP4MODE1                        BANKMASK(CCP4CON), 1
#define CCP4MODE2                        BANKMASK(CCP4CON), 2
#define CCP4MODE3                        BANKMASK(CCP4CON), 3
#define CCP4OUT                          BANKMASK(CCP4CON), 5
#define CCP4PPS0                         BANKMASK(CCP4PPS), 0
#define CCP4PPS1                         BANKMASK(CCP4PPS), 1
#define CCP4PPS2                         BANKMASK(CCP4PPS), 2
#define CCP4PPS3                         BANKMASK(CCP4PPS), 3
#define CCP4PPS4                         BANKMASK(CCP4PPS), 4
#define CCP5CTS0                         BANKMASK(CCP5CAP), 0
#define CCP5CTS1                         BANKMASK(CCP5CAP), 1
#define CCP5CTS2                         BANKMASK(CCP5CAP), 2
#define CCP5EN                           BANKMASK(CCP5CON), 7
#define CCP5FMT                          BANKMASK(CCP5CON), 4
#define CCP5IE                           BANKMASK(PIE6), 4
#define CCP5IF                           BANKMASK(PIR6), 4
#define CCP5MD                           BANKMASK(PMD3), 4
#define CCP5MODE0                        BANKMASK(CCP5CON), 0
#define CCP5MODE1                        BANKMASK(CCP5CON), 1
#define CCP5MODE2                        BANKMASK(CCP5CON), 2
#define CCP5MODE3                        BANKMASK(CCP5CON), 3
#define CCP5OUT                          BANKMASK(CCP5CON), 5
#define CCP5PPS0                         BANKMASK(CCP5PPS), 0
#define CCP5PPS1                         BANKMASK(CCP5PPS), 1
#define CCP5PPS2                         BANKMASK(CCP5PPS), 2
#define CCP5PPS3                         BANKMASK(CCP5PPS), 3
#define CCP5PPS4                         BANKMASK(CCP5PPS), 4
#define CCP5PPS5                         BANKMASK(CCP5PPS), 5
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CLC1IE                           BANKMASK(PIE5), 4
#define CLC1IF                           BANKMASK(PIR5), 4
#define CLC1MD                           BANKMASK(PMD5), 1
#define CLC2IE                           BANKMASK(PIE5), 5
#define CLC2IF                           BANKMASK(PIR5), 5
#define CLC2MD                           BANKMASK(PMD5), 2
#define CLC3IE                           BANKMASK(PIE5), 6
#define CLC3IF                           BANKMASK(PIR5), 6
#define CLC3MD                           BANKMASK(PMD5), 3
#define CLC4IE                           BANKMASK(PIE5), 7
#define CLC4IF                           BANKMASK(PIR5), 7
#define CLC4MD                           BANKMASK(PMD5), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKRMD                           BANKMASK(PMD0), 1
#define CMP1MD                           BANKMASK(PMD2), 1
#define CMP2MD                           BANKMASK(PMD2), 2
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE7), 6
#define CRCIF                            BANKMASK(PIR7), 6
#define CRCMD                            BANKMASK(PMD0), 4
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 6
#define CSWIF                            BANKMASK(PIR1), 6
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE7), 0
#define CWG1IF                           BANKMASK(PIR7), 0
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD4), 0
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define CWG2CS                           BANKMASK(CWG2CLKCON), 0
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5
#define CWG2EN                           BANKMASK(CWG2CON0), 7
#define CWG2IE                           BANKMASK(PIE7), 1
#define CWG2IF                           BANKMASK(PIR7), 1
#define CWG2IN                           BANKMASK(CWG2CON1), 5
#define CWG2ISM0                         BANKMASK(CWG2ISM), 0
#define CWG2ISM1                         BANKMASK(CWG2ISM), 1
#define CWG2ISM2                         BANKMASK(CWG2ISM), 2
#define CWG2ISM3                         BANKMASK(CWG2ISM), 3
#define CWG2LD                           BANKMASK(CWG2CON0), 6
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5
#define CWG2MD                           BANKMASK(PMD4), 1
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2
#define CWG2OVRA                         BANKMASK(CWG2STR), 4
#define CWG2OVRB                         BANKMASK(CWG2STR), 5
#define CWG2OVRC                         BANKMASK(CWG2STR), 6
#define CWG2OVRD                         BANKMASK(CWG2STR), 7
#define CWG2POLA                         BANKMASK(CWG2CON1), 0
#define CWG2POLB                         BANKMASK(CWG2CON1), 1
#define CWG2POLC                         BANKMASK(CWG2CON1), 2
#define CWG2POLD                         BANKMASK(CWG2CON1), 3
#define CWG2PPS0                         BANKMASK(CWG2PPS), 0
#define CWG2PPS1                         BANKMASK(CWG2PPS), 1
#define CWG2PPS2                         BANKMASK(CWG2PPS), 2
#define CWG2PPS3                         BANKMASK(CWG2PPS), 3
#define CWG2PPS4                         BANKMASK(CWG2PPS), 4
#define CWG2REN                          BANKMASK(CWG2AS0), 6
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7
#define CWG2STRA                         BANKMASK(CWG2STR), 0
#define CWG2STRB                         BANKMASK(CWG2STR), 1
#define CWG2STRC                         BANKMASK(CWG2STR), 2
#define CWG2STRD                         BANKMASK(CWG2STR), 3
#define CWG3CS                           BANKMASK(CWG3CLKCON), 0
#define CWG3DBF0                         BANKMASK(CWG3DBF), 0
#define CWG3DBF1                         BANKMASK(CWG3DBF), 1
#define CWG3DBF2                         BANKMASK(CWG3DBF), 2
#define CWG3DBF3                         BANKMASK(CWG3DBF), 3
#define CWG3DBF4                         BANKMASK(CWG3DBF), 4
#define CWG3DBF5                         BANKMASK(CWG3DBF), 5
#define CWG3DBR0                         BANKMASK(CWG3DBR), 0
#define CWG3DBR1                         BANKMASK(CWG3DBR), 1
#define CWG3DBR2                         BANKMASK(CWG3DBR), 2
#define CWG3DBR3                         BANKMASK(CWG3DBR), 3
#define CWG3DBR4                         BANKMASK(CWG3DBR), 4
#define CWG3DBR5                         BANKMASK(CWG3DBR), 5
#define CWG3EN                           BANKMASK(CWG3CON0), 7
#define CWG3IE                           BANKMASK(PIE7), 2
#define CWG3IF                           BANKMASK(PIR7), 2
#define CWG3IN                           BANKMASK(CWG3CON1), 5
#define CWG3ISM0                         BANKMASK(CWG3ISM), 0
#define CWG3ISM1                         BANKMASK(CWG3ISM), 1
#define CWG3ISM2                         BANKMASK(CWG3ISM), 2
#define CWG3ISM3                         BANKMASK(CWG3ISM), 3
#define CWG3LD                           BANKMASK(CWG3CON0), 6
#define CWG3LSAC0                        BANKMASK(CWG3AS0), 2
#define CWG3LSAC1                        BANKMASK(CWG3AS0), 3
#define CWG3LSBD0                        BANKMASK(CWG3AS0), 4
#define CWG3LSBD1                        BANKMASK(CWG3AS0), 5
#define CWG3MD                           BANKMASK(PMD4), 2
#define CWG3MODE0                        BANKMASK(CWG3CON0), 0
#define CWG3MODE1                        BANKMASK(CWG3CON0), 1
#define CWG3MODE2                        BANKMASK(CWG3CON0), 2
#define CWG3OVRA                         BANKMASK(CWG3STR), 4
#define CWG3OVRB                         BANKMASK(CWG3STR), 5
#define CWG3OVRC                         BANKMASK(CWG3STR), 6
#define CWG3OVRD                         BANKMASK(CWG3STR), 7
#define CWG3POLA                         BANKMASK(CWG3CON1), 0
#define CWG3POLB                         BANKMASK(CWG3CON1), 1
#define CWG3POLC                         BANKMASK(CWG3CON1), 2
#define CWG3POLD                         BANKMASK(CWG3CON1), 3
#define CWG3PPS0                         BANKMASK(CWG3PPS), 0
#define CWG3PPS1                         BANKMASK(CWG3PPS), 1
#define CWG3PPS2                         BANKMASK(CWG3PPS), 2
#define CWG3PPS3                         BANKMASK(CWG3PPS), 3
#define CWG3PPS4                         BANKMASK(CWG3PPS), 4
#define CWG3REN                          BANKMASK(CWG3AS0), 6
#define CWG3SHUTDOWN                     BANKMASK(CWG3AS0), 7
#define CWG3STRA                         BANKMASK(CWG3STR), 0
#define CWG3STRB                         BANKMASK(CWG3STR), 1
#define CWG3STRC                         BANKMASK(CWG3STR), 2
#define CWG3STRD                         BANKMASK(CWG3STR), 3
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DABORT                           BANKMASK(SCANCON0), 4
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1OE2                          BANKMASK(DAC1CON0), 4
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DACMD                            BANKMASK(PMD2), 6
#define DATA0                            BANKMASK(CRCDATL), 0
#define DATA1                            BANKMASK(CRCDATL), 1
#define DATA10                           BANKMASK(CRCDATH), 2
#define DATA11                           BANKMASK(CRCDATH), 3
